//Задача 2. Программа принимает на вход два числа и показывает, какое из них больше, а какое меньше.

int a=55, b=7;
if (a>b)
{
    Console.WriteLine($"max= {a}");
}
else
{
    Console.WriteLine($"max= {b}");
}