//Задача 6: Программа на вход принимает число и показывает, является ли число чётным.

int number=-8;
//int number=337;
//int number=7;
if (number%2==0)
{
    System.Console.WriteLine($"Число {number}- четное");
}
else
{
    System.Console.WriteLine($"Число {number}- не четное");
}
