//Задача 1: Программа принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа.
int a,b,c;
a=587;
b=a%100;
c=b/10;
System.Console.WriteLine(c);